<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>PB138 OdsSearch projekt report</title><meta name="generator" content="DocBook XSL Stylesheets V1.79.1"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div lang="en" class="article"><div class="titlepage"><div><div><h1 class="title"><a name="d5e1"></a>PB138 OdsSearch projekt report</h1></div><div><div class="author"><h3 class="author">Marek Abaffy</h3><code class="email">&lt;<a class="email" href="mailto:422572@mail.muni.cz">422572@mail.muni.cz</a>&gt;</code></div></div></div><hr></div><div class="toc"><p><b>Table of Contents</b></p><dl class="toc"><dt><span class="section"><a href="#introduction">&Uacute;vod</a></span></dt><dt><span class="section"><a href="#solution">Popis rie&#353;enia</a></span></dt><dt><span class="section"><a href="#conclusion">Zhrnutie</a></span></dt></dl></div><div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="introduction"></a>&Uacute;vod</h2></div></div></div><p>
			Na&#353;ou &uacute;lohou bolo implementova&#357; jednoduch&uacute; java aplik&aacute;cia, ktor&aacute; by u&#382;&iacute;vate&#318;ovi umo&#382;&#328;ovala vyh&#318;ad&aacute;va&#357; fr&aacute;zy v Open Spreadsheet dokumente.
		</p></div><div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="solution"></a>Popis rie&#353;enia</h2></div></div></div><p>
			Na u&#318;ah&#269;enie pr&aacute;ce sme si zvolili kni&#382;nicu Apache ODF Toolkit, ktor&aacute; n&aacute;m poskytla z&aacute;kladn&eacute; rozhranie na preh&#318;ad&aacute;vanie tabuliek. S vyu&#382;it&iacute;m tejto API sme implementovali triedu OdsSearch, ktor&aacute; poskytuje ak&uacute;si nadstavbu a s vyu&#382;it&iacute;m Odf Toolkit umo&#382;&#328;uje preh&#318;ad&aacute;vanie vybran&eacute;ho s&uacute;boru. V r&aacute;mci t&iacute;mu sme sa rozhodli, &#382;e zadanie roz&#353;&iacute;rime a u&#382;&iacute;vate&#318;ovi poskytneme mo&#382;nos&#357; vyh&#318;ad&aacute;va&#357; na z&aacute;klade ist&yacute;ch volieb. API OdsSearch teda poskytuje mo&#382;nos&#357; nastavenia typov vyh&#318;ad&aacute;vania. Dostupn&eacute; je vyh&#318;ad&aacute;vanie rozli&#353;uj&uacute;ce ve&#318;kos&#357; znakov, vyh&#318;ad&aacute;vanie podre&#357;azcov a taktie&#382; vyh&#318;ad&aacute;vanie pod&#318;a regul&eacute;rnehu v&yacute;razu. 
		</p><p>
			Mojou hlavnou &uacute;lohou bolo navrhn&uacute;&#357; &#353;trukt&uacute;ru projektu a vytvori&#357; jeho z&aacute;kladn&uacute; kostru, pr&aacute;ca s vybranou kni&#382;nicou a celkov&aacute; organiz&aacute;cia. V r&aacute;mci programovania som vypom&aacute;hal na implement&aacute;ci&iacute; triedy OdsSearch a refaktoroval v&yacute;sledn&yacute; k&oacute;d.
			&#268;o sa t&yacute;ka organiz&aacute;cie, mojou &uacute;lohou bolo komunikova&#357; s ved&uacute;cim projektu a spolupr&aacute;ca pri spr&aacute;ve str&aacute;nok projektu.
		</p></div><div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="conclusion"></a>Zhrnutie</h2></div></div></div><p>
			Zdrojov&yacute; k&oacute;d v&yacute;slednej aplik&aacute;cie je uverejnen&yacute; na str&aacute;nke Github spolu s detailnej&#353;&iacute;m popisom projektu.
		</p></div></div></body></html>