<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>PB138 OdsSearch - Z&aacute;v&#283;re&#269;n&aacute; zpr&aacute;va</title><meta name="generator" content="DocBook XSL Stylesheets V1.79.1"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div lang="en" class="article"><div class="titlepage"><div><div><h1 class="title"><a name="d5e1"></a>PB138 OdsSearch - Z&aacute;v&#283;re&#269;n&aacute; zpr&aacute;va</h1></div><div><div class="author"><h3 class="author">Ladislav Otoupal</h3><code class="email">&lt;<a class="email" href="mailto:otoupal93@seznam.cz">otoupal93@seznam.cz</a>&gt;</code></div></div></div><hr></div><div class="toc"><p><b>Table of Contents</b></p><dl class="toc"><dt><span class="section"><a href="#introduction">&Uacute;vod</a></span></dt><dt><span class="section"><a href="#solution">M&#367;j p&#345;&iacute;nos</a></span></dt><dt><span class="section"><a href="#conclusion">Z&aacute;v&#283;r</a></span></dt></dl></div><div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="introduction"></a>&Uacute;vod</h2></div></div></div><p>Na&#353;&iacute;m c&iacute;lem bylo vytvo&#345;it jednoduchou aplikaci v jav&#283;, kter&aacute; m&#283;la poskytovat vyhled&aacute;v&aacute;n&iacute; dat v souboru ve form&aacute;tu ODS.</p></div><div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="solution"></a>M&#367;j p&#345;&iacute;nos</h2></div></div></div><p>Pod&iacute;lel jsem se na n&aacute;vrhu u&#382;ivatelsk&eacute;ho rozhran&iacute; na&#353;&iacute; aplikace a jeho samotn&eacute; implementaci. Na tvorbu rozhran&iacute; jsme pou&#382;ili standardn&iacute; knihovnu jazyka java swing. D&aacute;le jsem finalizoval podobu wiki str&aacute;nek a pom&aacute;hal s tvorbou prezentace.</p><p>Nejd&#345;&iacute;ve jsem se pod&iacute;lel na n&aacute;vrhu grafick&eacute;ho rozhran&iacute;. To jsme navrhovali spolu s Tom&aacute;&#353;em. Napojen&iacute; grafick&eacute;ho rozhran&iacute; na logiku aplikace provedl Tom&aacute;&#353;. M&yacute;m hlavn&iacute;m &uacute;kolem bylo reagovat na p&#345;ipom&iacute;nky koleg&#367;, kte&#345;&iacute; psali backend aplikace a podle jejich p&#345;ipom&iacute;nek upravovat chov&aacute;n&iacute; jednotliv&yacute;ch prvk&#367; grafick&eacute;ho rozhran&iacute;. To jsme &#345;e&#353;ili pomoc&iacute; issue trackingu kter&yacute; n&aacute;m poskytoval github. D&aacute;le jsem tak&eacute; realizoval spou&#353;t&#283;n&iacute; vyhled&aacute;v&aacute;n&iacute; ve vl&aacute;kn&#283; a p&#345;&iacute;&#353;lu&#353;n&eacute; chov&aacute;n&iacute; prvk&#367; grafick&eacute;ho rozhran&iacute;. K tomu jsem pou&#382;il t&#345;&iacute;du swingworker, kterou n&aacute;m takt&eacute;&#382; poskytuje java. P&#367;vodn&#283; jsem cht&#283;l je&#353;t&#283; u&#382;ivateli poskytnout mo&#382;nost v&yacute;b&#283;ru "instantn&iacute;ho vyhled&aacute;v&aacute;n&iacute;". Aplikace m&#283;la u&#382;ivateli poskytnout mo&#382;nost vyhled&aacute;v&aacute;n&iacute; a zobrazov&aacute;n&iacute; v&yacute;sledk&#367; v re&aacute;ln&eacute;m &#269;ase, n&#283;co na zp&#367;sob zobrazov&aacute;n&iacute; v&yacute;sledk&#367; vyhled&aacute;v&aacute;n&iacute; v googlu, a ne a&#382; po stisku tla&#269;&iacute;tka search(p&#345;&iacute;padn&#283; kl&aacute;vesy enter). Nakonec jsme se s kolegy rozhodli od tohoto kroku ustoupit a funkcionalitu zru&#353;it. P&#345;i prohled&aacute;v&aacute;n&iacute; men&#353;&iacute;ho objemu dat vyhled&aacute;v&aacute;n&iacute; fungovalo dob&#345;e. Probl&eacute;m nastal s rostouc&iacute;m objemem prohled&aacute;van&yacute;ch dat. </p></div><div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="conclusion"></a>Z&aacute;v&#283;r</h2></div></div></div><p>Do wiki str&aacute;nek jsem p&#345;idal str&aacute;nku s dokumenatac&iacute; a pomohl vytvo&#345;it p&aacute;r slajd&#367; v prezentaci. Mysl&iacute;m, &#382;e zad&aacute;n&iacute; se n&aacute;m poda&#345;ilo dodr&#382;et a program by m&#283;l poskytovat o&#269;ek&aacute;vanou funkcionalitu.</p></div></div></body></html>